; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)   
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)
        (increase (total-cost) (fly-cost ?location_from ?location_to))        
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l8_p8_c8_g8_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(person-at person1 loc2)
	(person-at person2 loc6)
	(person-at person3 loc4)
	(person-at person4 loc3)
	(person-at person5 loc3)
	(person-at person6 loc8)
	(person-at person7 loc3)
	(person-at person8 loc5)
(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 215)
	(= (fly-cost depot loc2) 147)
	(= (fly-cost depot loc3) 176)
	(= (fly-cost depot loc4) 165)
	(= (fly-cost depot loc5) 62)
	(= (fly-cost depot loc6) 131)
	(= (fly-cost depot loc7) 191)
	(= (fly-cost depot loc8) 164)
	(= (fly-cost loc1 depot) 215)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 143)
	(= (fly-cost loc1 loc3) 179)
	(= (fly-cost loc1 loc4) 82)
	(= (fly-cost loc1 loc5) 156)
	(= (fly-cost loc1 loc6) 94)
	(= (fly-cost loc1 loc7) 107)
	(= (fly-cost loc1 loc8) 58)
	(= (fly-cost loc2 depot) 147)
	(= (fly-cost loc2 loc1) 143)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 45)
	(= (fly-cost loc2 loc4) 159)
	(= (fly-cost loc2 loc5) 124)
	(= (fly-cost loc2 loc6) 129)
	(= (fly-cost loc2 loc7) 199)
	(= (fly-cost loc2 loc8) 91)
	(= (fly-cost loc3 depot) 176)
	(= (fly-cost loc3 loc1) 179)
	(= (fly-cost loc3 loc2) 45)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 203)
	(= (fly-cost loc3 loc5) 164)
	(= (fly-cost loc3 loc6) 173)
	(= (fly-cost loc3 loc7) 243)
	(= (fly-cost loc3 loc8) 132)
	(= (fly-cost loc4 depot) 165)
	(= (fly-cost loc4 loc1) 82)
	(= (fly-cost loc4 loc2) 159)
	(= (fly-cost loc4 loc3) 203)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 104)
	(= (fly-cost loc4 loc6) 39)
	(= (fly-cost loc4 loc7) 40)
	(= (fly-cost loc4 loc8) 79)
	(= (fly-cost loc5 depot) 62)
	(= (fly-cost loc5 loc1) 156)
	(= (fly-cost loc5 loc2) 124)
	(= (fly-cost loc5 loc3) 164)
	(= (fly-cost loc5 loc4) 104)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 69)
	(= (fly-cost loc5 loc7) 133)
	(= (fly-cost loc5 loc8) 110)
	(= (fly-cost loc6 depot) 131)
	(= (fly-cost loc6 loc1) 94)
	(= (fly-cost loc6 loc2) 129)
	(= (fly-cost loc6 loc3) 173)
	(= (fly-cost loc6 loc4) 39)
	(= (fly-cost loc6 loc5) 69)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 75)
	(= (fly-cost loc6 loc8) 65)
	(= (fly-cost loc7 depot) 191)
	(= (fly-cost loc7 loc1) 107)
	(= (fly-cost loc7 loc2) 199)
	(= (fly-cost loc7 loc3) 243)
	(= (fly-cost loc7 loc4) 40)
	(= (fly-cost loc7 loc5) 133)
	(= (fly-cost loc7 loc6) 75)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 118)
	(= (fly-cost loc8 depot) 164)
	(= (fly-cost loc8 loc1) 58)
	(= (fly-cost loc8 loc2) 91)
	(= (fly-cost loc8 loc3) 132)
	(= (fly-cost loc8 loc4) 79)
	(= (fly-cost loc8 loc5) 110)
	(= (fly-cost loc8 loc6) 65)
	(= (fly-cost loc8 loc7) 118)
	(= (fly-cost loc8 loc8) 1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate8 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space1)
   goals met: 1 of 9
2. (put-crate-in-carrier crate5 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space2)
   goals met: 1 of 9
3. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 0 of 9
4. (pick-and-drop crate5 loc8 drone1 carrier1 space2 person6 food)
   deleted: (crate-at-space crate5 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person6 food)
   goals met: 1 of 9
5. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 9
6. (put-crate-in-carrier crate4 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space2)
   goals met: 2 of 9
7. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 1 of 9
8. (pick-and-drop crate4 loc5 drone1 carrier1 space2 person8 food)
   deleted: (crate-at-space crate4 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person8 food)
   goals met: 2 of 9
9. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 9
10. (put-crate-in-carrier crate3 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space2)
   goals met: 3 of 9
11. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 2 of 9
12. (pick-and-drop crate3 loc2 drone1 carrier1 space2 person1 food)
   deleted: (crate-at-space crate3 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person1 food)
   goals met: 3 of 9
13. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 9
14. (put-crate-in-carrier crate2 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space2)
   goals met: 4 of 9
15. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 3 of 9
16. (pick-and-drop crate8 loc2 drone1 carrier1 space1 person1 medicine)
   deleted: (crate-at-space crate8 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 medicine)
   goals met: 4 of 9
17. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 9
18. (put-crate-in-carrier crate7 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space1)
   goals met: 5 of 9
19. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 4 of 9
20. (pick-and-drop crate2 loc6 drone1 carrier1 space2 person2 food)
   deleted: (crate-at-space crate2 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person2 food)
   goals met: 5 of 9
21. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 9
22. (put-crate-in-carrier crate1 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space2)
   goals met: 6 of 9
23. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 5 of 9
24. (pick-and-drop crate1 loc3 drone1 carrier1 space2 person5 food)
   deleted: (crate-at-space crate1 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person5 food)
   goals met: 6 of 9
25. (pick-and-drop crate7 loc3 drone1 carrier1 space1 person7 medicine)
   deleted: (crate-at-space crate7 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person7 medicine)
   goals met: 7 of 9
26. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 9
27. (put-crate-in-carrier crate6 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space1)
   goals met: 8 of 9
28. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 7 of 9
29. (pick-and-drop crate6 loc6 drone1 carrier1 space1 person2 medicine)
   deleted: (crate-at-space crate6 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person2 medicine)
   goals met: 8 of 9
30. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 9
